tutorials/box/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    emptyPatches_empt
    {
        type            empty;
    }

    "(bottom_cyc|top_cyc)"
    {
      type freestream;
      value $internalField;
    }
    inlet_cyc
    {
        type            cyclicAMI;
        value           uniform 300;
    }
    outlet_cyc
    {
        type            cyclicAMI;
        value           uniform 300;
    }
}


// ************************************************************************* //
