tutorials/box/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0375;

boundaryField
{
    "(inlet_cyc|outlet_cyc)"
    {
        type            cyclicAMI;
        value           $internalField;
    }

    "(bottom_cyc|top_cyc)"
    {
      type freestream;
      freestreamValue $internalField;
    } 
    emptyPatches_empt
    {
        type            empty;
    }
       
}


// ************************************************************************* //
